# Taps
tap 'homebrew/cask'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'mas' # Mac App Store manager
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'tmux'
brew 'tree'
brew 'htop'
brew 'neovim'
brew 'stow'

# Image stuff
brew 'webp'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'node'
brew 'deno'
brew 'nvm'
brew 'yarn'
brew 'imagemagick'
brew 'mysql'
brew 'postgresql'
brew 'protobuf'
brew 'rust'

# Apps
cask 'discord'
cask 'figma'
cask 'intellij-idea'
cask 'rectangle'
cask 'vlc'
cask 'webtorrent'
cask 'appcleaner'
cask 'spotify'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'iterm2'
cask 'google-chrome'
cask 'firefox'
cask 'browserstacklocal'
cask 'hiddenbar'
cask 'slack'
cask 'betterzip'
cask 'suspicious-package'
cask 'zoom'
cask 'docker'
cask 'flux'

# Quicklook
cask 'webpquicklook'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'

# Terminal
brew 'zsh-syntax-highlighting'
brew 'romkatv/powerlevel10k/powerlevel10k'

mas 'Spark', id: 1176895641